from firebase_uploader import init_firebase
from firebase_admin import db

init_firebase()

SONIC_TEAM_RIDERS = [
    '최경민', '윤규범', '신성욱', '박무성', '송득근',
    '정우혁', '김경섭', '장근영', '조윤환', '조승래',
    '정기정', '정규태', '장재근', '최지나', '이종필',
    '이정민', '이재상', '이재관', '윤철훈', '유영멸',
    '엄정철', '심재득', '신진학', '배준호', '박정민',
    '김주동', '김재현', '김상엽', '김동규', '권휘재',
    '최지용', '김종찬', '이상엽', '노우현', '박성우',
    '배재현', '신정훈', '최현준', '이부관',
]

NUMBER_TEAM_RIDERS = [
    '유호성', '박세창', '강명원', '김수진', '배서후',
    '김요한', '김정근', '남승호', '이현재', '이윤재',
    '정수영', '장정석', '최영진', '임현석', '임승범',
    '이태훈', '이철우', '이재현', '이은성', '이영희',
    '이선노', '이동석', '우효상', '서강원', '한동훈',
    '마경민', '노재권', '남윤정', '남동욱', '김현준',
    '김태하', '김종희', '김용운', '김영천', '김명수',
    '김명한', '김동국', '권오현', '황홍섭', '강지은',
    '최윤호', '신명섭', '윤민석', '김애선', '이대겸',
    '김대운', '이헌재', '김병수', '이재헌', '한창목',
]

MAEUM_TEAM_RIDERS = [
    '임용우', '김강호', '김영우', '강지우',
    '이승훈', '박성림', '이영민', '손성곤', '구상훈',
    '박한울', '신가희', '박연호', '김형택', '김낙훈',
    '권영남', '이진복', '김석원', '길태빈', '김창범',
    '박광용', '성영길', '박원희', '최영우', '이전필',
    '이재현', '이강현', '김대한', '여세동', '신정하',
    '임지훈', '장민서', '임종현', '윤동근', '도수현',
    '김동현', '정동진', '정동수', '전한', '전하경',
    '전승욱', '전대명', '장예환', '장대웅', '임재백',
    '이진욱', '이진승', '이승준', '이경태', '전현',
    '최현주', '안호식', '신원순', '서봉용', '박호일',
    '도인환', '노지훈', '김현진', '김지성', '김재훈',
    '황유경', '김성현', '김서현', '문영신', '곽봉수',
    '장민규', '김효겸', '송인섭', '김종서', '김종호',
    '남재화', '박남아', '구용태', '한대성', '윤정원',
    '손지수', '김숙자', '김현숙', '최종현', '김인수',
    '김일식', '신인호', '구자돈', '차무길', '차성원',
    '박지홍', '이예준', '위석훈', '피우덕', '소귀숙',
    '피우정', '백창열', '하태수', '명재규', '한희숙',
    '김동욱', '김도형', '김대환', '김임식', '명제규',
    '박성립', '신정학', '신원준', '임종헌', '전승옥',
]

team_map = {}

for name in SONIC_TEAM_RIDERS:
    team_map[name] = "소닉팀"

for name in NUMBER_TEAM_RIDERS:
    team_map[name] = "넘버팀"

for name in MAEUM_TEAM_RIDERS:
    team_map[name] = "마음팀"

print("업로드 예정 기사 수:", len(team_map))

db.reference("/settings/dalseob/teamMap").update(team_map)

print("달서B teamMap 업로드 완료")
print(f"업로드 기사 수: {len(team_map)}명")
